// // Обычный коментарий.
// /*
// Напишите программу, которая на вход 
// принимает 2 целых числа и проверяет,
// является ли первое число квадратом второго.
// a = 25, b = 5 => да
// a = 2, b = 10 => нет
// a = 9, b = -3 => да
// a = -3, b = 9 => нет
// */

// // Тип_данных имяПеременной = значение;
// int firstNumber = 25; // firstNumber = 30
// int secondNumber = 5; // secondNumber = 5
// //"=": a = 30, присвоение.
// //"=="- Проверка на равенство: 5 == 5(true), 4 == 5 (false)
// // "!="-Проверка на НЕравенство: 4 != 5(true), 5 != 5(false)
// if (firstNumber == secondNumber * secondNumber)
// {
//     Console.WriteLine("Да"); // 1-число это квадрат 2го числа?
// }
// else
// {
//     Console.WriteLine("Нет"); // 1-число НЕ является квадратом 2го числа?
// }